{
    "personal": {
        "name": "Devansh Shah",
        "title": "MS Computer Science at NYU Courant",
        "role": "Aspiring Data Scientist/ML Engineer",
        "description": "Designing AI systems that connect security, language, and intelligence to solve real-world problems. Strong foundation in computer science and machine learning, with a passion for turning complex ideas into practical solutions. Always eager to learn, explore new perspectives, and contribute to projects that make a meaningful impact.",
        "image": "/devansh.jpg",
        "imageAlt": "Devansh Shah",
        "aboutImage": "/me.jpeg",
        "email": "dns5508@nyu.edu"
    },
    "socialLinks": [
        {
            "name": "Contact me",
            "url": "mailto:dns5508@nyu.edu",
            "icon": "Mail"
        },
        {
            "name": "LinkedIn",
            "url": "https://www.linkedin.com/in/devansh-shah11",
            "icon": "LinkedIn"
        },
        {
            "name": "GitHub",
            "url": "https://github.com/devansh-shah-11",
            "icon": "GitHub"
        }
    ],
    "about": [
        "I am a passionate Computer Science student with strong experience in Machine Learning, Deep Learning, and LLM Security. My journey spans both professional roles and community projects — from building red-teaming pipelines for chatbots to creating multilingual speech translation systems for global audiences.",
        "I enjoy collaborating across disciplines and thrive in solving complex problems at the intersection of AI, security, and scalable system design. Whether in research teams or volunteering with mission-driven organizations, I value diverse perspectives that lead to impactful solutions.",
        "Beyond academics, I am motivated by the real-world impact of technology — from AI systems that enhance accessibility to secure frameworks that make applications more resilient. With a focus on continuous learning, I aspire to build systems that are not only technically robust but also meaningful to society."
    ],
    "experiences": [
        {
            "date": "July 2024 - July 2025",
            "title": "AI Researcher",
            "company": "BlueInfy Solutions, Ahmedabad",
            "description": "Led development of an automated red-teaming framework for AI chatbots using Llama-3.1 and Phi-3.5 Mini. Created synthetic data generation pipelines aligned with OWASP top 10 LLM attacks to strengthen security testing. Designed a vulnerability assessment system with a 5-point severity grading scale using fine-tuned LLMs, significantly reducing man-hours for pentesters. Worked extensively with Open-source LLM models, HuggingFace, Streamlit, Python (FastAPI)."
        },
        {
            "date": "Jan 2024 - Jun 2024",
            "title": "Machine Learning Intern",
            "company": "NightHack Technologies, Bangalore",
            "description": "Developed an AI-based music generator integrating facial expression, text, and voice sentiment analysis to create personalized music via Meta's MusicGen. Implemented multiprocessing pipelines reducing response latency by 20%, and achieved 84% accuracy in mood-based predictions for 50+ pilot users. Gained hands-on experience with multimodal AI systems, real-time optimizations, and user-centric design."
        },
        {
            "date": "Jun 2023 - Jul 2023",
            "title": "Machine Learning Intern",
            "company": "Innovatics, Ahmedabad",
            "description": "Built a custom OCR model with 87% accuracy for extracting handwritten text and tick marks from survey forms. Enhanced performance using targeted data augmentation and region-specific labeling. Automated a loan form processing pipeline to generate analytics-ready data for insurance assessments, streamlining workflows for financial analysis."
        }
    ],
    "education": [
        {
            "date": "Sep 2025 - present",
            "degree": "Master of Computer Science",
            "institution": "New York University, Courant Institute of Mathematical Sciences",
            "description": "Graduate studies with focus on Machine Learning and  Distributed Systems. Research interests include LLM security and multilingual AI systems"
        },
        {
            "date": "2020 - 2024",
            "degree": "Bachelor of Technology, Computer Science and Engineering",
            "institution": "Institute of Technology, Nirma University, Ahmedabad",
            "description": "Data Structures and Algorithms, Machine Learning, Deep Learning, Digital Image Processing, Information Retrieval Systems, Computer Networks, Operating Systems, Big Data Analytics, Ethical Hacking."
        }

    ],
    "technologies": {
        "PYTHON": {
            "name": "Python",
            "class": "bg-[#3776AB] text-white",
            "icon": "Python"
        },
        "PYTORCH": {
            "name": "PyTorch",
            "class": "bg-[#ee4c2c] text-white",
            "icon": "PyTorch"
        },
        "TENSORFLOW": {
            "name": "Tensorflow",
            "class": "bg-[#ff6f00] text-white",
            "icon": "Tensorflow"
        },
        "STREAMLIT": {
            "name": "Streamlit",
            "class": "bg-black text-white",
            "icon": "Streamlit"
        },
        "FIREBASE": {
            "name": "Firebase",
            "class": "bg-[#ffca28] text-black",
            "icon": "Firebase"
        },
        "DOCKER": {
            "name": "Docker",
            "class": "bg-[#0db7ed] text-white",
            "icon": "Docker"
        },
        "AWS": {
            "name": "AWS EC2",
            "class": "bg-[#ff9900] text-white", 
            "icon": "AWS"
        },
        "GCP": {
            "name": "GCP",
            "class": "bg-[#ff9900] text-white",
            "icon": "GCP"
        },
        "NODE": {
            "name": "Node.js",
            "class": "bg-[#68A063] text-white",
            "icon": "Node"
        }
    },
    "projects": [
        {
            "title": "Multilingual Speech Translation System",
            "description": "Built a speeach recognitio pipeline using NVIDIA NeMo and OpenAI Whisper, fine-tuned for Gujarati (a low-resource language). Developed translation workflows to render spiritual discourses into 8 languages in the original speaker’s voice, reaching 1.2M+ subscribers across 191 countries. Preprocessed a large dataset using voice activity detection and forced alignment pipelines. Implemented semantic evaluation metrics with LLMs to improve translation quality.",
            "tags": ["PYTHON"]
        },
        {
            "title": "Advanced RAG Framework",
            "description": "Designed a Retrieval-Augmented Generation (RAG) system for multilingual chatbot recommendations. Implemented a two-step retrieval process combining summarization and smart chunking, improving both accuracy and latency. Optimized for diverse formats — PDFs, websites, audio, and video — enabling personalized and scalable knowledge delivery.",
            "tags": ["PYTHON"]
        },
        {
            "title": "Efficient Waste Management System",
            "description": "Led a team of 3 to develop an AI-driven waste categorization system for Ahmedabad. Fine-tuned YOLOv8 to classify waste, achieving 80% accuracy. Addressed distribution shift by curating a localized dataset of Indian waste patterns. Applied data mining to optimize waste collection routes and recycling processes, contributing to sustainable city management.",
            "tags": ["PYTHON", "TENSORFLOW"]
        },
        {
            "title": "Face Recognition System",
            "description": "Developed and deployed a face recognition system optimized for Indian faces, leveraging a ResNet backbone with triplet loss. Deployed across multiple clubs in Ahmedabad, impacting 8,000+ users. Open-sourced as a Python package, enabling developers to train, fine-tune, and evaluate Siamese-based models easily.",
            "tags": ["PYTHON", "TENSORFLOW", "PYTORCH"]
        },
        {
            "title": "Custom Object Detection System with TensorFlow.js and Firebase",
            "description": "Developed a custom object detection system using Pretrained Effecientnet model using tensorflow, converted to TensorFlow.js for real-time deployment on a React website. Integrated Firebase for secure login authentication and displayed real-time object counts on a dynamic dashboard.",
            "image": "/projects/object-detection-system.webp",
            "link": "https://devasy23-object-detection-system-app-5mulol.streamlit.app/",
            "tags": ["PYTHON", "FIREBASE", "TENSORFLOW", "NODE"]
        }
    ]
}